app/controllers/admin/albums_controller.rb

  def index
    @albums = Album.by_name.all
---
SELECT `albums`.* FROM `albums` ORDER BY name