app/controllers/admin/events_controller.rb

  def index
    @events = Event.by_name.all
---
SELECT `events`.* FROM `events` ORDER BY name