app/controllers/admin/institutionals_controller.rb

SELECT `institutionals`.* FROM `institutionals` LIMIT 1
---
  def new
    @institutional = Institutional.first || Institutional.new