app/controllers/admin/partners_controller.rb

SELECT `partners`.* FROM `partners` ORDER BY name
---
  def index
    @partners = Partner.by_name.all