app/controllers/admin/projects_controller.rb

  def index
    @projects = Project.by_name.all
---
SELECT `projects`.* FROM `projects` ORDER BY name