app/controllers/admin/users_controller.rb

  def index
    @users = User.by_name.all
---
SELECT `users`.* FROM `users` ORDER BY name