app/controllers/contacts_controller.rb

  def new
    @contact = Contact.new
    @partners = Partner.actives.random.all
---
SELECT `partners`.* FROM `partners` WHERE `partners`.`active` = 1 ORDER BY RAND()