app/controllers/events_controller.rb

  def index
    @events = Event.actives.all
    @partners = Partner.actives.random.all
---
SELECT `events`.* FROM `events` WHERE `events`.`active` = 1
SELECT `partners`.* FROM `partners` WHERE `partners`.`active` = 1 ORDER BY RAND()