app/controllers/institutionals_controller.rb

SELECT `institutionals`.* FROM `institutionals` LIMIT 1
SELECT `partners`.* FROM `partners` WHERE `partners`.`active` = 1 ORDER BY RAND()
---
  def index
    @institutional = Institutional.first.body
    @partners = Partner.actives.random.all

SELECT `institutionals`.* FROM `institutionals` LIMIT 1
---
  def principles
    @principles = Institutional.first.principles