app/controllers/projects_controller.rb

  def index
    @projects = Project.actives.all
    @partners = Partner.actives.random.all
---
SELECT `projects`.* FROM `projects` WHERE `projects`.`active` = 1
SELECT `partners`.* FROM `partners` WHERE `partners`.`active` = 1 ORDER BY RAND()